requireiot/MyGateway-ESP32-ETH/src/main.cpp
/**
 * @file 		  main.cpp
 *
 * Project		: Home automation
 * Author		: Bernd Waldmann
 * Created		: 03-Oct-2024
 * Tabsize		: 4
 * 
 * This Revision: $Id: main.cpp 1684 2024-11-27 11:09:46Z  $
 */

/*
   Copyright (C) 2024 Bernd Waldmann

   This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. 
   If a copy of the MPL was not distributed with this file, You can obtain one at http://mozilla.org/MPL/2.0/

   SPDX-License-Identifier: MPL-2.0
*/

/*
  Relies on MySensors, Created by Henrik Ekblad <henrik.ekblad@mysensors.org>.
  Note that the MySensors library is under GPL, so 
  - if you want to combine this source code file with the MySensors library 
    and redistribute it, then read the GPL to find out what is allowed.
  - if you want to combine this file with the MySensors library and only 
    use it at home, then read the GPL to find out what is allowed.
  - if you want to take just this source code, learn from it, modify it, and 
    redistribute it, independent from MySensors, then you have to abide by 
    my license rules (MPL 2.0), which imho are less demanding than the GPL.
 */

/**
 * @brief MySensors gateway or repeater, with ESP32 with LAN8720 Ethernet adapter
*/

//----- some configuration options
// these are defined in platformio.ini, they are specific to each device
// #define USE_ETHERNET    // use Ethernet with LAN8720 rather than WiFi
// #define USE_HSPI        // implies MISO=12 MOSI=13 SCK=14 SS=15
// #define USE_DS18B20     // use temperature sensor
// #define MY_SEPARATE_PROCESS_TASK // loop() and _process() in separate tasks

// these can be enabled here, they are common to all devices
#define USE_SYSLOG      // report to remote syslog server, URL see below
#define USE_NTP         // get time from time server, URL see below
#define USE_HTTP        // enable web UI
#define USE_OTA         // enable over-the-air firmware update

//----- uncomment either of these two, here or in platformio.ini
//#define OPERATE_AS_GATEWAY
//#define OPERATE_AS_REPEATER

//----- the Arduino universe
#include <Arduino.h>
#include <WiFi.h>
#ifdef USE_ETHERNET
 #include <ETH.h>                // LGPLv2.1+ license
#endif
#ifdef USE_SYSLOG
 #include <Syslog.h>             // MIT license, https://github.com/arcao/Syslog
#endif
#ifdef USE_NTP
 #include <NTPClient.h>          // MIT license, https://github.com/arduino-libraries/NTPClient
#endif
#ifdef USE_OTA
 #include <ArduinoOTA.h>         // LGPLv2.1+ license, https://github.com/jandrassy/ArduinoOTA
#endif
#ifdef USE_HTTP 
 #include <WebServer.h>        // LGPLv2.1+ license
#endif
#ifdef USE_DS18B20
 #include <OneWire.h>
 #include <DS18B20.h>           // MIT license, https://github.com/RobTillaart/DS18B20_RT
#endif

//----- the ESP-IDF universe
#include <rom/rtc.h>            // Apache-2.0 license
#include <esp32/clk.h>
#include <esp_pm.h>

//----- my headers
#include "ansi.h"
#include "Revision.h"   // automatically generated header file with SVN revision
#include "secrets.h"    // WiFi password etc

//=====================================================================
#pragma region configuration

// default to repeater operation, unless specified otherwise above or in platformio.ini)
#if !defined(OPERATE_AS_GATEWAY) && !defined(OPERATE_AS_REPEATER)
 #define OPERATE_AS_REPEATER
#endif

#ifdef USE_ETHERNET
 #define IF_NAME "ETH"
#else
 #define ETH WiFi
 #define IF_NAME "WiFi"
#endif

#if defined(USE_ETHERNET) && !defined(USE_HSPI)
 #define USE_HSPI
#endif

//----- pins for LAN8720 Ethernet module
#define PIN_ETH_PHY_POWER   4      // Pin# of the enable for the ext crystal osc, -1 to disable
#define PIN_ETH_PHY_MDC     23      // Pin# of the I²C SCL
#define PIN_ETH_PHY_MDIO    18      // Pin# of the I²C SDA

//----- pin connected to DS18B20 temperature sensor (optional)
#define PIN_DS18B20         33      

//----- pins for SPI connected to NRF24 module
#ifdef USE_HSPI
 #define MY_RF24_CE_PIN      2
 #define MY_RF24_MISO_PIN    12
 #define MY_RF24_MOSI_PIN    13
 #define MY_RF24_SCK_PIN     14
 #define MY_RF24_CS_PIN      15
#else
 #define MY_RF24_CE_PIN     26
 #define MY_RF24_MISO_PIN    19
 #define MY_RF24_MOSI_PIN    23
 #define MY_RF24_SCK_PIN     18
 #define MY_RF24_CS_PIN      5 
#endif

//----- Syslog
#define SYSLOG_SERVER "log-server"
#define SYSLOG_PORT 514
#define SYSLOG_APPNAME "main"

//----- OTA
#define OTA_PASSWORD "123"
#define OTA_PORT    3232

//----- NTP
#define NTP_SERVER  "fritz.box"

//----- MySensors MQTT (only applies to gateway mode)
#define MY_CONTROLLER_URL_ADDRESS "ha-server"
#define MY_MQTT_PUBLISH_TOPIC_PREFIX "my/E/stat"
#define MY_MQTT_SUBSCRIBE_TOPIC_PREFIX "my/cmnd"

#define VERSION "$Id: main.cpp 1684 2024-11-27 11:09:46Z  $ "

#ifdef LED_BUILTIN
 #define LED_INIT   pinMode(LED_BUILTIN,OUTPUT);
 #define TURN_LED_ON     digitalWrite(LED_BUILTIN,HIGH)
 #define TURN_LED_OFF    digitalWrite(LED_BUILTIN,LOW)
#else
 #define LED_INIT
 #define TURN_LED_ON
 #define TURN_LED_OFF
#endif

//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region Timing

#define SECONDS		* 1000uL
#define MINUTES 	* 60uL SECONDS
#define HOURS 		* 60uL MINUTES
#define DAYS		* 24uL HOURS

/// minimum time between comms statistics reports
const unsigned long MIN_REPORT_INTERVAL = 60 MINUTES;
/// time between temperature measurements
const unsigned long REPORT_TEMPERATURE_INTERVAL = 30 MINUTES;

//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region MySensors

// when using Ethernet, RF24 module must be connected via SPI(2) default pins, 
// because SPI(3) default pins used by LAN8720
#include <SPI.h>
#ifdef USE_HSPI
 SPIClass hspi(HSPI);   // implies MISO=12 MOSI=13 SCK=14 SS=15
 #define RF24_SPI hspi
#else
 SPIClass vspi(VSPI);   // implies MISO=12 MOSI=13 SCK=14 SS=15
 #define RF24_SPI vspi
#endif

#define MY_RADIO_RF24
// with NRF24-PA-LNA module with external antenna, use this setting
// otherwise, too much interference
#define MY_RF24_PA_LEVEL RF24_PA_LOW

