requireiot/MyGateway-ESP32-ETH/src/main.cpp
#define MY_RF24_SPI_SPEED 1'000'000u
//#define MY_TRANSPORT_WAIT_READY_MS 3000 

// MySensors operating mode
//#define MY_DEBUG
//#define MY_DEBUG_VERBOSE_RF24
#define MY_INDICATION_HANDLER
#define MY_SPLASH_SCREEN_DISABLED

//----- operate as gateway
#ifdef OPERATE_AS_GATEWAY
 #ifdef USE_ETHERNET
  #define MY_GATEWAY_ESP32_ETHERNET
 #else
  #define MY_GATEWAY_ESP32_WIFI
 #endif
 #define MY_GATEWAY_MQTT_CLIENT
 #define FRIENDLY_PROJECT_NAME "ESP32 MySensors Gateway"
 #define NODE_ID_AS_SENSOR MY_NODE_ID
 #define MY_GATEWAY_MAX_CLIENTS 2
 //#define MY_RF24_CHANNEL 99    // test only
#endif

//----- operate as repeater
#ifdef OPERATE_AS_REPEATER
 #define MY_REPEATER_FEATURE
 #define FRIENDLY_PROJECT_NAME "ESP32 MySensors Repeater"
#endif

#include <MySensors.h>

#define SENSOR_ID_ARC		98
#define V_TYPE_ARC			V_VAR5
MyMessage arcMessage = MyMessage(SENSOR_ID_ARC, V_TYPE_ARC);

#define SENSOR_ID_CMND      96

#ifdef USE_DS18B20
 #define SENSOR_ID_TEMP 		41
 MyMessage msgTemperature(SENSOR_ID_TEMP, V_TEMP);
#endif

#define SENSOR_ID_HELLO     95
MyMessage msgHello(SENSOR_ID_HELLO, V_TEXT);

//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region Global variables

WiFiUDP udpClient;

#ifdef USE_SYSLOG
 Syslog syslog(udpClient, SYSLOG_SERVER, SYSLOG_PORT, "ESP32", SYSLOG_APPNAME, LOG_USER);
#endif

#ifdef USE_NTP
 NTPClient ntpClient(udpClient,NTP_SERVER);
#endif

#ifdef USE_HTTP 
 WebServer httpServer(80);
#endif

#ifdef USE_DS18B20
 OneWire ow(PIN_DS18B20);
 DS18B20 ds18b20(&ow);
 bool hasDS18B20 = false;
#endif

/// static buffer for assembling various messages
char msgbuf[256];


/// for counting indication() status notifications
struct RxTxStats_t {
	unsigned nRx, nTx, nGwRx, nGwTx, nErr;
} rxtxStats;

/// nMessagesRx[i] counts messages received from node id `i`
unsigned nMessagesRx[256];
/// nMessagesTx[i] counts messages sent to node id `i`
unsigned nMessagesTx[256];
/// nRetries[i] counts mretries required for messages sent to node id `i`
unsigned nRetries[256];

struct ArcStats_t {
    unsigned packets;   ///< number of packets sent
    unsigned retries;   ///< number of retries required
    unsigned success;   ///< success rate in percent
} arcStats;

const char* reset_reasons[] = {
"0: none",
"1: Vbat power on reset",
"2: unknown",
"3: Software reset digital core",
"4: Legacy watch dog reset digital core",
"5: Deep Sleep reset digital core",
"6: Reset by SLC module, reset digital core",
"7: Timer Group0 Watch dog reset digital core",
"8: Timer Group1 Watch dog reset digital core",
"9: RTC Watch dog Reset digital core",
"10: Instrusion tested to reset CPU",
"11: Time Group reset CPU",
"12: Software reset CPU",
"13: RTC Watch dog Reset CPU",
"14: for APP CPU, reseted by PRO CPU",
"15: Reset when the vdd voltage is not stable",
"16: RTC Watch dog reset digital core and rtc module"
};

time_t t_last_clear = 0;

time_t getTimeNow()
{
#ifdef USE_NTP
    return ntpClient.getEpochTime();
#else
    return time(nullptr);
#endif
}

//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region ARC statistics

/**
 * @brief Collect statistics re Automatic Retries Count (ARC) for RF24.
 * Call this function immediately after each `send()` call.
 * 
 * @return int  number of retries required for most recent send
 * 
 */
int collectArcStatistics()
{
	int rssi = transportHALGetSendingRSSI();	// boils down to (-29 - (8 * (RF24_getObserveTX() & 0xF)))
	int arc = (-(rssi+29))/8;
	arcStats.packets++;         // # of packets sent
	arcStats.retries += arc;    // # of retries required
    arcStats.success = 
        arcStats.packets ? 
            (100uL * arcStats.packets) / (arcStats.packets + arcStats.retries) 
            : 100;
    return arc;
}


/**
 * @brief Reset all statistics counters to zero. Do this every hour or so
 * 
 */
void initStats()
{
	memset( nMessagesRx, 0, sizeof(nMessagesRx));
	memset( nMessagesTx, 0, sizeof(nMessagesTx));
	memset( nRetries, 0, sizeof(nRetries));
	memset( &rxtxStats, 0, sizeof(rxtxStats) );
    memset( &arcStats, 0, sizeof arcStats );
    t_last_clear = getTimeNow();
}


/**
 * @brief Send JSON-esque message with error statistics, then reset counters.
 * Error statistics include # of packets sent, # of retries required, success rate
 * Call this once per hour or so
 * 
 * @return const char* pointer to string sent to MySensors, like "{P:100;R:10;S:90}"
 *
 * Success rate:
 * 5 packets 0 retries = 100%
 * 5 packets 5 retries = 50%
 * 5 packets 20 retries = 20%
 */
const char* reportArcStatistics()
{
	//              				    1...5...10...15...20...25 max payload
	//				                    |   |    |    |    |    |
	static char payload[26];	//      {P:65535;R:65535;S:100}
	snprintf(payload, sizeof payload, "{P:%u,R:%u,S:%u}",
        arcStats.packets, arcStats.retries, arcStats.success );

    //memset( &arcStats, 0, sizeof arcStats );
	arcMessage.setSensor(SENSOR_ID_ARC).setType(V_TYPE_ARC);
	delay(10);
    send(arcMessage.set(payload));
	return payload;
}

//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region OTA

#ifdef USE_OTA

void setupOTA()
{
//----- configure Over-The-Air updates
	ArduinoOTA.setPort( OTA_PORT );
	ArduinoOTA.setPassword( OTA_PASSWORD );
    ArduinoOTA.setHostname( ETH.getHostname());
    
	ArduinoOTA.onStart([]() {
		Serial.println("ArduinoOTA start");
	});
	ArduinoOTA.onEnd([]() {
		Serial.println("\nArduinoOTA end");
	});
	ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
		Serial.printf("OTA Progress: %u%%\r", (progress / (total / 100)));
	});
	ArduinoOTA.onError([](ota_error_t error) {
		Serial.printf("Error[%u]: ", error);
		if (error == OTA_AUTH_ERROR) {
			Serial.println("Auth Failed");
		} else if (error == OTA_BEGIN_ERROR) {
			Serial.println("Begin Failed");
		} else if (error == OTA_CONNECT_ERROR) {
			Serial.println("Connect Failed");
		} else if (error == OTA_RECEIVE_ERROR) {
			Serial.println("Receive Failed");
		} else if (error == OTA_END_ERROR) {
			Serial.println("End Failed");
		}
	});
	ArduinoOTA.begin();
}

#endif // USE_OTA

