requireiot/MyGateway-ESP32-ETH/src/main.cpp
//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region Webserver

#ifdef USE_HTTP 


const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE HTML><html>
<head>
  <title>%TITLE%</title>
  <style>
    body { background-color: #cccccc; font-family: Arial, Helvetica, Sans-Serif; Color: #000088; line-height: 1.1; }
    table { border-collapse: collapse; }
    td { text-align: right; border: 1px solid #777777; padding: 4px; }
    button { margin: 5px; padding:10px; min-height:20px; min-width: 80px; float:left; }
    .mph { color: #606060; font-size:smaller; }
    .suc { color: #fc03fc; font-size:smaller; }
  </style>
</head>
<body>
  <h2>%TITLE%</h2>
  <p>
    IP:<b>%IPADDR%</b>&emsp;
    Name:<b>%HOSTNAME%</b>&emsp;
    Channel:<b>%CHANNEL%</b>&emsp;
    Power:<b>%POWER%</b>&emsp;
)rawliteral"

#ifdef OPERATE_AS_REPEATER
 R"rawliteral(
    Node:<b>%NODEID%</b>&emsp;
    Parent:<b>%PARENT%</b>&emsp;
 )rawliteral"
#endif

R"rawliteral(
  </p>  
  <p>
    ARC <b>%SUCCESS%</b>%% success, <b>%PACKETS%</b> packets, <b>%RETRIES%</b> retries.&emsp;
  </p>
  <p>
    Node rx:<b>%NRX%</b>&ensp;tx:<b>%NTX%</b>&ensp;err:<b>%NERR%</b> (<b>%ERROR_RATE%</b>%%)&emsp;
)rawliteral"

#ifdef OPERATE_AS_GATEWAY
 R"rawliteral(
    Gateway: rx:<b>%NGWRX%</b>&ensp;tx:<b>%NGWTX%</b>
 )rawliteral"
#endif

R"rawliteral(
  </p>
  <p>
    since %LASTCLEAR% (%ELAPSED%)&emsp;
    time is now %NOW%
  </p>
  <p>%TABLE%</p>
  <form action="/clear"><button type="submit">Clear</button></form>
  <form action="/reboot"><button type="submit">Restart</button></form>
</body>
</html>
)rawliteral";


/**
 * @brief Convert unsigned int to string
 */
String utos( unsigned u )
{
    static char buf[10];
    utoa(u,buf,10);
    return String(buf);
}


/**
 * @brief Generate one HTML table row, #of messages received from nodes (y)..(y+9)
 * 
 * @param y 
 * @return String 
 */
String make_table_row(unsigned y, time_t nSecsElapsed)
{
    unsigned x, totalMsgsRx, MsgsPerHour, totalMsgsTx, totalRetries, success;

    String s = "<tr><th>" + utos(y) + ":</td>";
    for (x=0; x<10; x++) {

        totalMsgsRx = nMessagesRx[y + x];
        if (nSecsElapsed)
            MsgsPerHour = (totalMsgsRx * 3600uL) / nSecsElapsed;
        s += "<td>";
        if (totalMsgsRx > 0) {
            s += "<b>" + utos(totalMsgsRx) + "</b>";
            if (nSecsElapsed)
                s += "&ensp;<span class='mph'>" + utos(MsgsPerHour) + "/h</span>";
        }
        totalMsgsTx = nMessagesTx[y+x];
        if (totalMsgsTx > 0) {
            totalRetries = nRetries[y+x];
            success = (100 * totalMsgsTx) / (totalMsgsTx + totalRetries);
            s += "<br/><span class='suc'>" + utos(success) + "%</span>";
        }
        s += "</td>";
    }
    s += "</tr>\n";
    return s;
}


/**
 * @brief Generate HTML table with statistics (# of messages received per node)
 * 
 * @return String 
 */
String make_table() 
{
    String s;
    unsigned x,y;
    time_t nSecsElapsed = getTimeNow() - t_last_clear;

    s = "<table><tr><th> </th>";
    for (x=0; x<10; x++) s += "<th>&ensp;+" + utos(x) + "</th>";
    s += "</tr>\n";
    s += make_table_row(0,nSecsElapsed);
    s += make_table_row(20,nSecsElapsed);
    for (y=100; y<200; y+=10) {
        s += make_table_row(y,nSecsElapsed);
    }
    s += "</table>";
    return s;
}


/**
 * @brief Poor man's templating engine: replace keywords with content
 * 
 * @param var       the keyword that was enclosed in %...%
 * @return String   the replacement
 */
String processor(const String& var)
{
    if (var.length()==0) return "%";

    //----- static device information
    if (var=="IPADDR") return ETH.localIP().toString();
    if (var=="HOSTNAME") return ETH.getHostname();
    if (var=="NODEID") return String(MY_NODE_ID);
    if (var=="VERSION") return String(VERSION);
    if (var=="PARENT") return String(transportGetParentNodeId());
    //----- configuration
    if (var=="POWER") return String(MY_RF24_PA_LEVEL);
    if (var=="CHANNEL") return String(MY_RF24_CHANNEL);

    //-----indication-based counts
    // # of messages received via network
    if (var=="NRX") return String(rxtxStats.nRx);
    // # of messages sent via network
    if (var=="NTX") return String(rxtxStats.nTx);
    // # of messages failed to send via network
    if (var=="NERR") return String(rxtxStats.nErr);
    // # of messages received from controller, as gateway
    if (var=="NGWRX") return String(rxtxStats.nGwRx);
    // # of messages sent to controller, as gateway
    if (var=="NGWTX") return String(rxtxStats.nGwTx);
    // percentage of messages attempted to send that could not be sent
    if (var=="ERROR_RATE") return String( rxtxStats.nTx ? (100 * rxtxStats.nErr)/rxtxStats.nTx : 0 );

    //----- ARC statistics
    if (var=="PACKETS") return String(arcStats.packets);
    if (var=="RETRIES") return String(arcStats.retries);
    if (var=="SUCCESS") return String(arcStats.success);

    //----- general information
    if (var=="TITLE") return FRIENDLY_PROJECT_NAME ;
    if (var=="NOW") {
        time_t epoch = getTimeNow();
        strftime(msgbuf, sizeof msgbuf, "%d.%m.%Y %H:%M:%S", localtime(&epoch));
        return String(msgbuf);
    }
    if (var=="LASTCLEAR") {
        strftime(msgbuf, sizeof msgbuf, "%d.%m.%Y %H:%M:%S", localtime(&t_last_clear));
        return String(msgbuf);
    }
    if (var=="ELAPSED") {
        time_t t_elapsed = getTimeNow() - t_last_clear; // in seconds
        tm* te = gmtime(&t_elapsed);
        snprintf(msgbuf,sizeof msgbuf, "%dd %dh %dm", te->tm_yday, te->tm_hour, te->tm_min);
        return String(msgbuf);
    }
    //----- the biggie: table of messages vs node id
    if (var=="TABLE") return make_table();
    return String();
}


#define CHAR_BEGIN_VAR '%'
#define CHAR_END_VAR '%'

/**
 * @brief Poor man's templating engine: find all keywords 
 * 
 * @param tpl      the HTML with embedded keywords enclosed in %...%
 * @return String  final HTML
 */
static String process( const String& tpl )
{
    String res = "";
    int p1,p2;

