requireiot/MyGateway-ESP32-ETH/src/main.cpp
    p1 = tpl.indexOf(CHAR_BEGIN_VAR);
    p2 = 0;
    while (p1 != -1) {
        res += tpl.substring(p2,p1);
        p2 = tpl.indexOf(CHAR_END_VAR,p1+1);
        if (p2 != -1) {
            res += processor( tpl.substring(p1+1,p2) );
        }
        p1 = tpl.indexOf(CHAR_BEGIN_VAR,p2+1);
        p2++;
    }
    res += tpl.substring(p2);
    return res;
}


 void setupHTTPServer()
 {
    // Route for root / web page
    httpServer.on( "/", HTTP_GET, []() {
        log_i("HTTP '/'");
        httpServer.send(200, "text/html", process(index_html));
    });
    httpServer.on("/clear", HTTP_GET, [] () {
        log_i("HTTP '/clear'");
        initStats();
        httpServer.sendHeader("Location", "/",true);  
        httpServer.send(302, "text/plain", "");
    });
    httpServer.on("/reboot", HTTP_GET, [] () {
        log_i("HTTP '/reboot'");
        httpServer.sendHeader("Location", "/",true);  
        httpServer.send(302, "text/plain", "");
        ESP.restart();
    });
    httpServer.onNotFound( [] () {
        log_e("HTTP not found");
        httpServer.send(404, "text/plain", "not found");
    });
    // Start server
    httpServer.begin();
 }
#endif // USE_HTTP

//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region Network event handler

void WiFiEvent(WiFiEvent_t event) 
{
	switch (event) { 
	case ARDUINO_EVENT_WIFI_STA_START:
	case ARDUINO_EVENT_ETH_START:
        char buf[14];
        uint8_t mac[6];
        ETH.macAddress(mac);
        snprintf(buf, sizeof buf, "ESP32-%02hX%02hX%02hX", mac[3], mac[4], mac[5]);
		ETH.setHostname(buf);
		Serial.printf(
            "... " IF_NAME " started, set hostname to '" ANSI_BOLD "%s" ANSI_RESET "'\n"
            ,
            buf);
		break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
	case ARDUINO_EVENT_ETH_CONNECTED:
		Serial.printf(
            "... " IF_NAME " " ANSI_BRIGHT_GREEN "Connected" ANSI_RESET
#ifdef USE_ETHERNET
            " %s, %hu Mbps\n"
            ,
            ETH.fullDuplex() ? "FULL_DUPLEX" : "",
            ETH.linkSpeed()
#endif
            );
		break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
	case ARDUINO_EVENT_ETH_GOT_IP:
		Serial.printf("... " IF_NAME " "
            "MAC: " ANSI_BOLD "%s" ANSI_RESET ", "
            "IPv4: " ANSI_BOLD "%s" ANSI_RESET "\n"
            , 
            ETH.macAddress().c_str(), 
            ETH.localIP().toString().c_str()
            );
		break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
	case ARDUINO_EVENT_ETH_DISCONNECTED:
		Serial.println("... " IF_NAME " " ANSI_BRIGHT_RED "Disconnected" ANSI_RESET);
		break;
    case ARDUINO_EVENT_WIFI_STA_STOP:
	case ARDUINO_EVENT_ETH_STOP:
		Serial.println("... " IF_NAME " Stopped");
		break;
	default:
		break;
	}
}

//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region MySensors standard functions


/**
 * @brief Send information about sketch and sensors
 * (Standard MySensors function to be implemented in application)
 * 
 */
void presentation()
{
	static char rev[] = "$Rev: 1684 $";
	char* p = strchr(rev+6,'$');
	if (p) *p=0;

	// Present locally attached sensors here
	sendSketchInfo( 
        "MyGwESP32-ETH-"
    #ifdef OPERATE_AS_GATEWAY
        "Gateway"
    #else
        "Repeater"
    #endif
        , rev+6 );
	//              				    1...5...10...15...20...25 max payload
	//				                    |   |    |    |    |    |
	present(SENSOR_ID_ARC, S_CUSTOM, F("ARC stats (JSON)") );
    delay(10);
    present(SENSOR_ID_CMND, S_INFO, F("Commands"));
    delay(10);
#ifdef USE_DS18B20
	present( SENSOR_ID_TEMP, S_TEMP, F("Temperature [°C]" ));
#endif
}


/**
 * @brief React to various events reported by MySensors
 * (Standard MySensors function to be implemented in application)
 * 
 * @param ind 
 */
void indication( const indication_t ind )
{
	switch (ind) {
		case INDICATION_TX:		rxtxStats.nTx++; break;
		case INDICATION_RX: 	rxtxStats.nRx++; break;
		case INDICATION_GW_TX:	rxtxStats.nGwTx++; break;
		case INDICATION_GW_RX: 	rxtxStats.nGwRx++; break;
		case INDICATION_ERR_TX:	rxtxStats.nErr++; break;
		default: 				break;
	}
}


/**
 * @brief Callback when message is received
 * (Standard MySensors function to be implemented in application).
 * 
 * @param message 
 */
void receive(const MyMessage &message)
{
/*
#ifdef OPERATE_AS_GATEWAY
	nMessagesRx[ message.getSender() ]++;
#endif
*/
	// We only expect one type of message from controller. But we better check anyway.
	if (message.isAck()) {
		return;
	}
    const char* payload = message.getString();
    log_i("Msg Type:%d Sensor:%d Payload:'%s'",
		message.type, message.sensor, payload ? payload : "(none)");

	if (										// MQTT: my/cmnd/25/96/1/0/47   text
		message.sensor == SENSOR_ID_CMND && 
		message.type == V_TEXT 
		) {
		// parse command
        log_i("Execute command '%s'", payload ? payload : "(none)");

	} else {
        log_e("unknown message");
    }
}


//#ifdef OPERATE_AS_REPEATER
/**
 * @brief Let user code peek at incoming message _before_ it is forwarded to parent.
 * Defined in my modified MySensors library, as a "weak" function, i.e. the library 
 * will call this if it is defined in user code, or else quietly ignore it.
 * 
 * @param message 
 */
 void previewMessage(const MyMessage &message) 
 {
	nMessagesRx[ message.getSender() ]++;
 }

//#endif


/**
 * @brief Called immdiately after a message has been sent, so we can do ARC statistics
 * 
 * @param nextRecipient     the immediate destination node id, may be final destination or repeater
 * @param message           reference to the message being sent
 */
void aftertransportSend(const uint8_t nextRecipient, const MyMessage &message) 
{
    int arc = collectArcStatistics();
    nMessagesTx[ nextRecipient ]++;
    nRetries[ nextRecipient ] += arc;
}


//---------------------------------------------------------------------
#pragma endregion
//=====================================================================
#pragma region Local sensors
#ifdef USE_DS18B20

/**
 * @brief Initialize DS18B20 temperature sensor
 * 
 * @return true if sensor found and initialized
 * @return false if no sensor found
 */
bool initTemperature()
{
    bool res = ds18b20.begin();
    if (res) {
        hasDS18B20 = true;
        uint8_t addr[8];
        ds18b20.getAddress(addr);
        Serial.printf( 
            "Found DS18B20 at %02hX:%02hX:%02hX:%02hX:%02hX:%02hX:%02hX:%02hX\n",
            addr[0],addr[0],addr[2],addr[2],addr[3],addr[4],addr[5],addr[6],addr[7]
        );
        ds18b20.requestTemperatures();
    } else {
        Serial.println("No DS18B20 found");
    }
    return res;
}


void reportTemperature()
{
    if (hasDS18B20) {
        float t = ds18b20.getTempC();
        if (int(t) == 85) return;
        ds18b20.requestTemperatures();
        send(msgTemperature.set(t,1));
        Serial.printf("Temperature " ANSI_BOLD "%.1f" ANSI_RESET "°C\n",t);
    }
}

#endif // #ifdef USE_DS18B20
//---------------------------------------------------------------------
#pragma endregion

/**
 * @brief Early hardware initialization, called by MySensors library 
 * well before `setup()`. 
 * (Standard MySensors function to be implemented in application)
 */
void preHwInit(void)
{
	Serial.begin(115200,SERIAL_8N1);
    delay(3000);
	Serial.setDebugOutput(true);
	Serial.println(">>>>> begin preHwInit");

