requireiot/MyGateway-ESP32-ETH/src/main.cpp
	WiFi.onEvent(WiFiEvent);
    LED_INIT;
    TURN_LED_ON;

#ifdef USE_ETHERNET
    WiFi.mode(WIFI_OFF);
 #if ESP_ARDUINO_VERSION_MAJOR==3
    bool res = ETH.begin(
                    ETH_PHY_LAN8720,
                    1, //ESP_ETH_PHY_ADDR_AUTO,
                    PIN_ETH_PHY_MDC,
                    PIN_ETH_PHY_MDIO,
                    PIN_ETH_PHY_POWER,
                    ETH_CLOCK_GPIO0_IN
                );
 #else // ESP_ARDUINO_VERSION_MAJOR==3
    bool res = ETH.begin( 
                    1, //ESP_ETH_PHY_ADDR_AUTO,
                    PIN_ETH_PHY_POWER,
                    PIN_ETH_PHY_MDC,
                    PIN_ETH_PHY_MDIO,
                    ETH_PHY_LAN8720,
                    ETH_CLOCK_GPIO0_IN
                ); 
 #endif // ESP_ARDUINO_VERSION_MAJOR==3
#else // USE_ETHERNET
 #ifdef OPERATE_AS_REPEATER
    WiFi.mode(WIFI_STA);
    WiFi.begin(MY_WIFI_SSID,MY_WIFI_PASSWORD);
 #endif // OPERATE_AS_REPEATER
#endif // USE_ETHERNET
    delay(3000);
    TURN_LED_OFF;
	Serial.println(">>>>> end preHwInit");
    Serial.flush();
}


void setup() 
{
    int rtc_reset_reason = rtc_get_reset_reason(0);    

	Serial.println("---------- begin setup()");
    Serial.println(FRIENDLY_PROJECT_NAME " svn:" SVN_REV);
    Serial.println(VERSION "compiled " __DATE__ " " __TIME__);
    Serial.printf("Reset reason %s\n",reset_reasons[rtc_reset_reason]);

//----- report environment
      
    Serial.printf( ANSI_BOLD "%s" ANSI_RESET, 
        ESP.getChipModel() );
    Serial.printf(" at " ANSI_BOLD "%d" ANSI_RESET " MHz",
        (int)ESP.getCpuFreqMHz());
    Serial.printf(" (APB:%d)",
        getApbFrequency()/1000000 );
    Serial.printf("  Flash:" ANSI_BOLD "%d" ANSI_RESET "K", 
        (int)(ESP.getFlashChipSize() / 1024));
    Serial.printf("  Heap:" ANSI_BOLD "%d" ANSI_RESET, 
        ESP.getFreeHeap() );
    Serial.printf("  Core:" ANSI_BOLD "%s" ANSI_RESET, 
        ESP.getSdkVersion() );//esp_get_idf_version() );
    Serial.println();

    String sConfig = "Config: ";
#ifdef OPERATE_AS_REPEATER
    sConfig += "repeater, ";
#endif
#ifdef OPERATE_AS_GATEWAY
    sConfig += "gateway, ";
#endif
#ifdef USE_ETHERNET
    sConfig += "Ethernet, ";
#else
    sConfig += "WiFi, ";
#endif
#ifdef USE_HSPI
    sConfig += "HSPI, ";
#else
    sConfig += "VSPI, ";
#endif
#ifdef MY_SEPARATE_PROCESS_TASK
    sConfig += "2 tasks, ";
#else
    sConfig += "1 task, ";
#endif

    Serial.println( sConfig );

//----- Ethernet

    const char* hostname = ETH.getHostname();
    snprintf(msgbuf,sizeof(msgbuf), "MAC:%s  IP:%s  hostname:%s",
        ETH.macAddress().c_str(),
        ETH.localIP().toString().c_str(),
        hostname ? hostname : "(unknown)"
        );
    String sNetwork(msgbuf);

//----- NTP

    ntpClient.begin();
    ntpClient.forceUpdate();
    time_t now = ntpClient.getEpochTime();
    char snow[50];
    strftime(snow,sizeof(snow),"%F %T",localtime(&now));
    log_i("initialized NTP, current time %s", snow);

//----- Syslog

#ifdef USE_SYSLOG
    syslog.logMask(LOG_UPTO(LOG_INFO));
    syslog.deviceHostname(ETH.getHostname());
    log_i("initialized Syslog");

    syslog.logf(LOG_NOTICE,"Starting %s, reset reason '%s'", 
        FRIENDLY_PROJECT_NAME, reset_reasons[rtc_reset_reason] );
	syslog.logf(LOG_NOTICE, "env:%s svn:%s ver:%s compiled:%s",
         PIO_ENV, SVN_REV, VERSION, __DATE__ " " __TIME__ );
	syslog.log(LOG_NOTICE, sNetwork );
    syslog.log( LOG_NOTICE, sConfig );
    snprintf( msgbuf, sizeof msgbuf, 
        "Chip:%s F:%uMHz Flash:%uK Heap:%u Core:%s",
        ESP.getChipModel(),
        ESP.getCpuFreqMHz(),
        ESP.getFlashChipSize() / 1024,
        ESP.getFreeHeap(),
        ESP.getSdkVersion()
        );
    syslog.log(LOG_NOTICE,msgbuf);
#endif

//----- Webserver

#ifdef USE_HTTP
    setupHTTPServer();
    log_i("initialized HTTP server");
#endif

//----- OTA

#ifdef USE_OTA
    setupOTA();
    log_i("initialized OTA");
#endif

//----- locally attached sensors

    initStats();

//----- Temperature sensor

#ifdef USE_DS18B20
    if (initTemperature()) {
        reportTemperature();
    }
#endif

//----- done

    const char* arc = reportArcStatistics();
    log_i("ARC: %s",arc);

	Serial.println("---------- end setup()");
    Serial.flush();
}


void loop() 
{
    unsigned long t_now = millis();
 
#if defined( USE_HTTP) 
    httpServer.handleClient();
#endif

#ifdef USE_OTA
    ArduinoOTA.handle();
#endif

#ifdef USE_NTP
    ntpClient.update();
#endif

#ifdef USE_DS18B20
    // report module temperature
	static unsigned long t_lastTemperatureReport=0;
	if ((unsigned long)(t_now - t_lastTemperatureReport) > REPORT_TEMPERATURE_INTERVAL) {
		t_lastTemperatureReport=t_now;
        reportTemperature();
    }
#endif

    // every now and then, report ARC statistics ("pseudo-RSSI")
	static unsigned long t_lastReport=0;
	if ((unsigned long)(t_now - t_lastReport) > MIN_REPORT_INTERVAL) {
		t_lastReport=t_now;
        wait(1);
        const char* arc = reportArcStatistics();
        log_i("ARC: %s",arc);
        //initStats();
	}

#ifdef LED_BUILTIN
    // blink LED
    static unsigned t_last_LED=0;
	if ((unsigned long)(t_now - t_last_LED) > 50uL) {
		t_last_LED=t_now;
        unsigned t = t_now & 0x3FF; // count up to ~1000ms
        if (t < 50) TURN_LED_ON; else TURN_LED_OFF;
    }
#endif
}
